{
    "title": "Insurance Query App",
    "index_names": [
        "Insurance (Appeal to Securities Appellate Tribunal) Rules, 2016.pdf",
        "Insurance Act,1938 - incorporating all amendments till 20212021-08-12.pdf",
        "IRDA Act as amended by Insurance Laws(Amendment) Act 2015.pdf",
        "Motor Vehicles (Third Party Insurance Base Premium and Liability) Rules, 2022.pdf"
    ],
    "summaries": [
        "The document is a set of rules titled \"Insurance (Appeal to Securities Appellate Tribunal) Rules, 2016\" published by the Indian government. It outlines the procedures and definitions related to insurance appeals to the Securities Appellate Tribunal. The document, written in Hindi, includes details about the format and submission of appeals, the timeline, necessary documentation, and the possibility of appeal rejection. It also mentions the Indian Regulatory and Development Authority Act, 1999. However, due to the presence of non-translatable characters and repeated lines, a comprehensive summary cannot be provided.",
        "The Insurance Act of 1938, incorporating all amendments up to 2021, is a comprehensive document outlining the regulations and provisions for insurers in India. The Act covers a wide range of topics including the appointment of a Controller of Insurance, registration requirements, capital structure requirements, and the licensing of agents. It also details the process for amalgamation and transfer of insurance business, and the management of insurance business by an administrator. The Act stipulates that an insurance company must have a minimum paid-up capital of one hundred crore rupees and that no foreign body corporate can hold more than twenty-six percent of the capital of such a company. The Act also outlines the conditions under which an insurer's registration may be suspended or cancelled, and the requirements for insurers and insurance businesses in India. The Act has undergone several amendments, with key changes made in 2015.",
        "The Insurance Regulatory and Development Authority Act, 1999, provides for the establishment of an Authority to protect the interests of insurance policy holders, regulate and promote the insurance industry, and ensure its orderly growth. The Act also amends the Insurance Act, 1938, the Life Insurance Corporation Act, 1956, and the General Insurance Business (Nationalisation) Act, 1972. The Authority, known as the Insurance Regulatory and Development Authority of India, is a body corporate with the power to acquire, hold and dispose of property, and to contract. The Authority consists of a Chairperson, not more than five whole-time members, and not more than four part-time members. The Act also outlines the duties, powers and functions of the Authority, which include issuing certificates of registration, protecting the interests of policy-holders, and regulating the insurance business.",
        "The document is titled \"Motor Vehicles (Third Party Insurance Base Premium and Liability) Rules, 2022\" and was published by the Ministry of Road Transport and Highways in New Delhi on May 25, 2022. The rules were drafted after considering all objections and suggestions received from the public for the financial year 2022-23. The rules, which will come into effect from June 1, 2022, outline the base premium for third-party insurance for different types of vehicles. The document includes a table detailing the rates for various categories of vehicles, including private cars, two-wheelers, and goods carrying vehicles."
    ],
    "model_choice": "gpt-4"
}